In [3]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [4]:
df=DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one  0.315262 -0.535107
1    a  two  1.181762  0.151045
2    b  one  1.166328 -0.218555
3    b  two  0.314066  0.576572
4    a  one  0.630493  0.562732

In [6]:
grouped=df['data1'].groupby(df['key1'])

In [9]:
grouped.sum()

key1
a    2.127517
b    1.480394
Name: data1, dtype: float64

In [12]:
sum=df['data1'].groupby([df['key1'], df['key2']]).sum()

In [13]:
sum

key1  key2
a     one     0.945756
      two     1.181762
b     one     1.166328
      two     0.314066
Name: data1, dtype: float64

In [14]:
sum.unstack()

key2       one       two
key1
a     0.945756  1.181762
b     1.166328  0.314066

In [15]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [16]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [17]:
years=np.array([2005,2005,2006,2005,2006])

In [19]:
df['data1'].groupby([states,years]).sum()

California  2005    1.181762
            2006    1.166328
Ohio        2005    0.629328
            2006    0.630493
Name: data1, dtype: float64

In [20]:
df.groupby('key1').sum()

         data1     data2
key1
a     2.127517  0.178670
b     1.480394  0.358017

In [21]:
df.groupby(['key1','key2']).sum()

              data1     data2
key1 key2
a    one   0.945756  0.027625
     two   1.181762  0.151045
b    one   1.166328 -0.218555
     two   0.314066  0.576572

In [27]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [29]:
df.groupby('key1')

In [32]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.315262 -0.535107
1    a  two  1.181762  0.151045
4    a  one  0.630493  0.562732
b
  key1 key2     data1     data2
2    b  one  1.166328 -0.218555
3    b  two  0.314066  0.576572

In [35]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print (k1,k2)
    print (group)

a one
  key1 key2     data1     data2
0    a  one  0.315262 -0.535107
4    a  one  0.630493  0.562732
a two
  key1 key2     data1     data2
1    a  two  1.181762  0.151045
b one
  key1 key2     data1     data2
2    b  one  1.166328 -0.218555
b two
  key1 key2     data1     data2
3    b  two  0.314066  0.576572

In [36]:
pieces=dict(list(df.groupby('key1')))

In [38]:
pieces['b']

  key1 key2     data1     data2
2    b  one  1.166328 -0.218555
3    b  two  0.314066  0.576572

In [42]:
df.dtypes
grouped=df.groupby(df.dtypes, axis=1)
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  0.315262 -0.535107
 1  1.181762  0.151045
 2  1.166328 -0.218555
 3  0.314066  0.576572
 4  0.630493  0.562732, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [46]:
df.groupby('key1')['data1'].sum()

key1
a    2.127517
b    1.480394
Name: data1, dtype: float64

In [48]:
df.groupby('key1')[['data1']].sum()

         data1
key1
a     2.127517
b     1.480394

In [51]:
df['data1'].groupby(df['key1']).sum()

key1
a    2.127517
b    1.480394
Name: data1, dtype: float64

In [54]:
df[['data1']].groupby(df['key1']).sum()

         data1
key1
a     2.127517
b     1.480394

In [57]:
df.groupby(['key1','key2'])[['data2']].sum()

              data2
key1 key2
a    one   0.027625
     two   0.151045
b    one  -0.218555
     two   0.576572

In [58]:
people=DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])
people.ix[2:3,['b','c']]=np.nan

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [59]:
people

               a         b         c         d         e
Joe    -1.194553  1.399063  0.402468  0.401481 -1.911839
Steve  -1.214060  1.781451 -0.732571  0.916727 -1.735744
Wes     0.647909       NaN       NaN  0.277086 -2.929434
Jim    -0.011027 -0.208314 -0.332354  0.546481 -0.075873
Travis  0.190586  0.119548 -0.412540 -0.379005  0.018383

In [60]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [61]:
by_column=people.groupby(mapping, axis=1)

In [62]:
by_column.sum()

            blue       red
Joe     0.803949 -1.707330
Steve   0.184156 -1.168353
Wes     0.277086 -2.281525
Jim     0.214127 -0.295214
Travis -0.791546  0.328517

In [63]:
map_series=Series(mapping)

In [64]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [65]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.557671  1.190749  0.070114  1.225047 -4.917147
5 -1.214060  1.781451 -0.732571  0.916727 -1.735744
6  0.190586  0.119548 -0.412540 -0.379005  0.018383

In [66]:
key_list=['one','one','one','two','two']

In [67]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.194553  1.399063  0.402468  0.277086 -2.929434
  two -0.011027 -0.208314 -0.332354  0.546481 -0.075873
5 one -1.214060  1.781451 -0.732571  0.916727 -1.735744
6 two  0.190586  0.119548 -0.412540 -0.379005  0.018383

In [74]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])
hier_df=DataFrame(np.random.randn(4,5), columns=columns)
hier_df.groupby(level='tenor', axis=1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

In [69]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.882219  0.327240  2.374345  0.445203  0.510260
1     -0.058277  0.486732  2.421827 -0.371265 -1.609993
2     -0.996722 -2.549175 -1.504707  0.100698 -1.081948
3      0.039327  0.432501 -1.093094 -0.360979 -0.462781

In [70]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [78]:
grouped=df.groupby('key1')
grouped.count()

      key2  data1  data2
key1
a        3      3      3
b        2      2      2

In [76]:
grouped['data1'].quantile(0.9)

key1
a    1.071508
b    1.081102
Name: data1, dtype: float64

In [80]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.866500  1.097839
b     0.852262  0.795126

In [81]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.709172  0.438575  0.315262  0.472878  0.630493  0.906128
b      2.0  0.740197  0.602641  0.314066  0.527131  0.740197  0.953263

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.181762   3.0  0.059557  0.554608 -0.535107 -0.192031  0.151045
b     1.166328   2.0  0.179009  0.562239 -0.218555 -0.019773  0.179009


           75%       max
key1
a     0.356889  0.562732
b     0.377790  0.576572

In [87]:
k1_sum=df.groupby('key1').sum().add_prefix('sum_')
pd.merge(df,k1_sum,left_on='key1',right_index=True)

  key1 key2     data1     data2  sum_data1  sum_data2
0    a  one  0.315262 -0.535107   2.127517   0.178670
1    a  two  1.181762  0.151045   2.127517   0.178670
4    a  one  0.630493  0.562732   2.127517   0.178670
2    b  one  1.166328 -0.218555   1.480394   0.358017
3    b  two  0.314066  0.576572   1.480394   0.358017

In [89]:
key=['one','two','one','two','one']
people.groupby(key).sum()

            a         b         c         d         e
one -0.356057  1.518610 -0.010072  0.299561 -4.822891
two -1.225087  1.573137 -1.064925  1.463208 -1.811617

In [90]:
people

               a         b         c         d         e
Joe    -1.194553  1.399063  0.402468  0.401481 -1.911839
Steve  -1.214060  1.781451 -0.732571  0.916727 -1.735744
Wes     0.647909       NaN       NaN  0.277086 -2.929434
Jim    -0.011027 -0.208314 -0.332354  0.546481 -0.075873
Travis  0.190586  0.119548 -0.412540 -0.379005  0.018383

In [91]:
people.groupby(key).transform(np.sum)

               a         b         c         d         e
Joe    -0.356057  1.518610 -0.010072  0.299561 -4.822891
Steve  -1.225087  1.573137 -1.064925  1.463208 -1.811617
Wes    -0.356057  1.518610 -0.010072  0.299561 -4.822891
Jim    -1.225087  1.573137 -1.064925  1.463208 -1.811617
Travis -0.356057  1.518610 -0.010072  0.299561 -4.822891

In [93]:
def demean(arr):
    return arr-arr.mean()

demeaned = people.groupby(key).transform(demean)

In [94]:
demeaned.groupby(key).mean()

                a             b             c             d             e
one  1.850372e-17  0.000000e+00  0.000000e+00 -1.850372e-17  7.401487e-17
two  0.000000e+00 -5.551115e-17  2.775558e-17 -5.551115e-17 -5.551115e-17

In [95]:
frame=DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
factor=pd.cut(frame.data1, 4)
print (factor[:10])

0    (-3.817, -1.831]
1     (-1.831, 0.146]
2     (-1.831, 0.146]
3    (-3.817, -1.831]
4     (-1.831, 0.146]
5      (0.146, 2.124]
6     (-1.831, 0.146]
7     (-1.831, 0.146]
8      (0.146, 2.124]
9      (0.146, 2.124]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.817, -1.831] < (-1.831, 0.146] < (0.146, 2.124] < (2.124, 4.102]]

In [96]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}
grouped=frame.data2.groupby(factor)

In [97]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.817, -1.831]   30.0  1.994061  0.238943 -1.283979
(-1.831, 0.146]   508.0  3.165203 -0.074121 -2.831742
(0.146, 2.124]    439.0  3.452632  0.054173 -3.123577
(2.124, 4.102]     23.0  1.117918 -0.044468 -2.415712

In [98]:
grouping=pd.qcut(frame.data1, 10 ,labels=False)
grouped=frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  1.994061 -0.153147 -2.831742
1      100.0  2.209607 -0.100574 -2.693586
2      100.0  1.906040  0.008644 -2.410435
3      100.0  2.703630 -0.047262 -2.078137
4      100.0  3.165203  0.108220 -2.418523
5      100.0  2.064185  0.018848 -2.471564
6      100.0  2.499749 -0.001254 -3.123577
7      100.0  3.235619  0.181642 -2.729596
8      100.0  3.452632  0.035256 -2.670062
9      100.0  1.797669 -0.127630 -2.424895

In [99]:
data=DataFrame({'key1':['a','b','c','a','c','a','b','a','c','a','b','c'],'key2':['one','two','three','two','one','one','three','one','two','three','one','two'],'num1':np.random.rand(12),'num2':np.random.randn(12)})

In [100]:
data

   key1   key2      num1      num2
0     a    one  0.902907  2.013733
1     b    two  0.888824 -2.056533
2     c  three  0.568224 -0.022465
3     a    two  0.406109  0.136516
4     c    one  0.151083  0.403138
5     a    one  0.192615 -1.184621
6     b  three  0.176464  1.796559
7     a    one  0.650914 -0.876658
8     c    two  0.187141 -0.196289
9     a  three  0.328815  0.997214
10    b    one  0.455511  1.335889
11    c    two  0.617546 -0.105497

In [102]:
pd.crosstab(data.key1,data.key2)

key2  one  three  two
key1
a       3      1    1
b       1      1    1
c       1      1    2

In [103]:
pd.crosstab(data.key1,data.key2,margins=True)

key2  one  three  two  All
key1
a       3      1    1    5
b       1      1    1    3
c       1      1    2    4
All     5      3    4   12

In [104]:
data.pivot_table('num1',index='key1',columns='key2',aggfunc='count')

key2  one  three  two
key1
a       3      1    1
b       1      1    1
c       1      1    2

In [105]:
data.groupby(['key1','key2'])['num1'].count().unstack()

key2  one  three  two
key1
a       3      1    1
b       1      1    1
c       1      1    2

In [106]:
data.pivot_table(index='key1',columns='key2')

          num1                          num2
key2       one     three       two       one     three       two
key1
a     0.582145  0.328815  0.406109 -0.015849  0.997214  0.136516
b     0.455511  0.176464  0.888824  1.335889  1.796559 -2.056533
c     0.151083  0.568224  0.402343  0.403138 -0.022465 -0.150893

In [107]:
data.pivot_table(index='key1',columns='key2',aggfunc='sum')

          num1                          num2
key2       one     three       two       one     three       two
key1
a     1.746436  0.328815  0.406109 -0.047546  0.997214  0.136516
b     0.455511  0.176464  0.888824  1.335889  1.796559 -2.056533
c     0.151083  0.568224  0.804687  0.403138 -0.022465 -0.301786